## Ordinal Number Encoding

In [1]:
import numpy as np
import pandas as pd

In [2]:
import datetime

In [3]:
today_date = datetime.datetime.today()
today_date

datetime.datetime(2022, 4, 17, 18, 48, 23, 597588)

In [4]:
today_date - datetime.timedelta(2)

datetime.datetime(2022, 4, 15, 18, 48, 23, 597588)

In [5]:
for x in range(0,15):
    print(x)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14

In [6]:
### List Comprehension

days = [today_date - datetime.timedelta(x) for x in range(0, 15)]

In [7]:
df = pd.DataFrame(days)

In [8]:
df

                            0
0  2022-04-17 18:48:23.597588
1  2022-04-16 18:48:23.597588
2  2022-04-15 18:48:23.597588
3  2022-04-14 18:48:23.597588
4  2022-04-13 18:48:23.597588
5  2022-04-12 18:48:23.597588
6  2022-04-11 18:48:23.597588
7  2022-04-10 18:48:23.597588
8  2022-04-09 18:48:23.597588
9  2022-04-08 18:48:23.597588
10 2022-04-07 18:48:23.597588
11 2022-04-06 18:48:23.597588
12 2022-04-05 18:48:23.597588
13 2022-04-04 18:48:23.597588
14 2022-04-03 18:48:23.597588

In [9]:
df.rename(columns={0: 'Day'}, inplace=True)

In [10]:
df

                          Day
0  2022-04-17 18:48:23.597588
1  2022-04-16 18:48:23.597588
2  2022-04-15 18:48:23.597588
3  2022-04-14 18:48:23.597588
4  2022-04-13 18:48:23.597588
5  2022-04-12 18:48:23.597588
6  2022-04-11 18:48:23.597588
7  2022-04-10 18:48:23.597588
8  2022-04-09 18:48:23.597588
9  2022-04-08 18:48:23.597588
10 2022-04-07 18:48:23.597588
11 2022-04-06 18:48:23.597588
12 2022-04-05 18:48:23.597588
13 2022-04-04 18:48:23.597588
14 2022-04-03 18:48:23.597588

In [11]:
df.Day.dt.day

0     17
1     16
2     15
3     14
4     13
5     12
6     11
7     10
8      9
9      8
10     7
11     6
12     5
13     4
14     3
Name: Day, dtype: int64

In [12]:
df.Day.dt.year

0     2022
1     2022
2     2022
3     2022
4     2022
5     2022
6     2022
7     2022
8     2022
9     2022
10    2022
11    2022
12    2022
13    2022
14    2022
Name: Day, dtype: int64

In [13]:
df.Day.dt.month

0     4
1     4
2     4
3     4
4     4
5     4
6     4
7     4
8     4
9     4
10    4
11    4
12    4
13    4
14    4
Name: Day, dtype: int64

In [14]:
df.Day.dt.hour

0     18
1     18
2     18
3     18
4     18
5     18
6     18
7     18
8     18
9     18
10    18
11    18
12    18
13    18
14    18
Name: Day, dtype: int64

In [15]:
df.Day.dt.minute

0     48
1     48
2     48
3     48
4     48
5     48
6     48
7     48
8     48
9     48
10    48
11    48
12    48
13    48
14    48
Name: Day, dtype: int64

In [16]:
df['weekday'] = df['Day'].dt.day_name()

In [17]:
df

                          Day    weekday
0  2022-04-17 18:48:23.597588     Sunday
1  2022-04-16 18:48:23.597588   Saturday
2  2022-04-15 18:48:23.597588     Friday
3  2022-04-14 18:48:23.597588   Thursday
4  2022-04-13 18:48:23.597588  Wednesday
5  2022-04-12 18:48:23.597588    Tuesday
6  2022-04-11 18:48:23.597588     Monday
7  2022-04-10 18:48:23.597588     Sunday
8  2022-04-09 18:48:23.597588   Saturday
9  2022-04-08 18:48:23.597588     Friday
10 2022-04-07 18:48:23.597588   Thursday
11 2022-04-06 18:48:23.597588  Wednesday
12 2022-04-05 18:48:23.597588    Tuesday
13 2022-04-04 18:48:23.597588     Monday
14 2022-04-03 18:48:23.597588     Sunday

In [18]:
dictionary = {
    'Monday': 1,
    'Tuesday': 2,
    'Wednesday':3,
    'Thursday': 4,
    'Friday':5,
    'Saturday':6,
    'Sunday':7
}

In [19]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [20]:
df['weekday_ordinal'] = df['weekday'].map(dictionary)

In [21]:
df

                          Day    weekday  weekday_ordinal
0  2022-04-17 18:48:23.597588     Sunday                7
1  2022-04-16 18:48:23.597588   Saturday                6
2  2022-04-15 18:48:23.597588     Friday                5
3  2022-04-14 18:48:23.597588   Thursday                4
4  2022-04-13 18:48:23.597588  Wednesday                3
5  2022-04-12 18:48:23.597588    Tuesday                2
6  2022-04-11 18:48:23.597588     Monday                1
7  2022-04-10 18:48:23.597588     Sunday                7
8  2022-04-09 18:48:23.597588   Saturday                6
9  2022-04-08 18:48:23.597588     Friday                5
10 2022-04-07 18:48:23.597588   Thursday                4
11 2022-04-06 18:48:23.597588  Wednesday                3
12 2022-04-05 18:48:23.597588    Tuesday                2
13 2022-04-04 18:48:23.597588     Monday                1
14 2022-04-03 18:48:23.597588     Sunday                7

### Count Or Frequency Encoding

In [22]:
df = pd.read_csv('./CSV Files/adult.csv')

In [23]:
df.shape

(32560, 15)

In [24]:
df.columns

Index(['39', ' State-gov', ' 77516', ' Bachelors', ' 13', ' Never-married',
       ' Adm-clerical', ' Not-in-family', ' White', ' Male', ' 2174', ' 0',
       ' 40', ' United-States', ' <=50K'],
      dtype='object')

In [25]:
len(df.columns)

15

In [26]:
df[' State-gov'].unique()

array([' Self-emp-not-inc', ' Private', ' State-gov', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [27]:
df[' State-gov'].nunique()

9

In [28]:
df.dtypes

39                 int64
 State-gov        object
 77516             int64
 Bachelors        object
 13                int64
 Never-married    object
 Adm-clerical     object
 Not-in-family    object
 White            object
 Male             object
 2174              int64
 0                 int64
 40                int64
 United-States    object
 <=50K            object
dtype: object

In [29]:
columns = [' State-gov', ' Bachelors',  ' Never-married',
       ' Adm-clerical', ' Not-in-family', ' White', ' Male', ' United-States', ' <=50K']

In [30]:
df = df[columns]

In [31]:
df.head(4)

,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,<=50K
0,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,<=50K
1,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,<=50K
2,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,<=50K
3,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,<=50K

In [32]:
df.nunique()

 State-gov         9
 Bachelors        16
 Never-married     7
 Adm-clerical     15
 Not-in-family     6
 White             5
 Male              2
 United-States    42
 <=50K             2
dtype: int64

In [33]:
df[' United-States'].value_counts()

 United-States                 29169
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Trinadad&Tobago                  19
 Cambodia                         19
 Thailand                         18
 Laos                             18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Hungary                          13
 Honduras                         13
 Scotland                         12
 Holand-Netherlands                1
Name:  United-States, dtype: int64

In [34]:
country_map = df[' United-States'].value_counts().to_dict()

In [35]:
df[' United-States'] = df[' United-States'].map(country_map)

In [36]:
df.head(10)

,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,<=50K
0,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29169,<=50K
1,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29169,<=50K
2,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29169,<=50K
3,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95,<=50K
4,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29169,<=50K
5,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81,<=50K
6,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29169,>50K
7,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29169,>50K
8,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29169,>50K
9,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29169,>50K

### Advantage:
1. Easy to Implement
2. Not Increasing Feature Space

### Disadvantage:
1. It will provide the same weight if the frequency count of the two categories are same

### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replacing the labels by the joint probability of being 1 or 0

In [37]:
df = pd.read_csv('./CSV Files/titanic_train.csv', usecols=['cabin', 'survived'])

In [38]:
df.head()

  cabin  survived
0   NaN         1
1   NaN         0
2   NaN         0
3   NaN         1
4   NaN         0

In [39]:
df.isnull().sum()

cabin       659
survived      0
dtype: int64

In [40]:
df.isnull().mean()

cabin       0.775294
survived    0.000000
dtype: float64

In [41]:
df.shape

(850, 2)

In [42]:
df['cabin'].fillna("Missing", inplace=True)

In [43]:
df.head()

     cabin  survived
0  Missing         1
1  Missing         0
2  Missing         0
3  Missing         1
4  Missing         0

In [44]:
df.cabin.value_counts()

Missing            659
B96 B98              4
B57 B59 B63 B66      4
D                    4
C22 C26              4
                  ...
B80                  1
E31                  1
D22                  1
D38                  1
B10                  1
Name: cabin, Length: 136, dtype: int64

In [45]:
df['cabin'].astype(str)

0      Missing
1      Missing
2      Missing
3      Missing
4      Missing
        ...
845        C39
846        B37
847    Missing
848    Missing
849    Missing
Name: cabin, Length: 850, dtype: object

In [46]:
df.dtypes

cabin       object
survived     int64
dtype: object

In [48]:
df['cabin'] = df.cabin.str[0]

In [49]:
df.head()

  cabin  survived
0     M         1
1     M         0
2     M         0
3     M         1
4     M         0

In [50]:
df.cabin.unique()

array(['M', 'C', 'D', 'E', 'B', 'F', 'A', 'G', 'T'], dtype=object)

In [51]:
df.groupby(['cabin'])['survived'].mean()

cabin
A    0.583333
B    0.733333
C    0.580645
D    0.709677
E    0.791667
F    0.666667
G    0.500000
M    0.282246
T    0.000000
Name: survived, dtype: float64

In [68]:
df.groupby(['cabin', 'survived']).size()

cabin  survived
A      0             5
       1             7
B      0            12
       1            33
C      0            26
       1            36
D      0             9
       1            22
E      0             5
       1            19
F      0             4
       1             8
G      0             2
       1             2
M      0           473
       1           186
T      0             1
dtype: int64

In [54]:
df.cabin.value_counts()

M    659
C     62
B     45
D     31
E     24
A     12
F     12
G      4
T      1
Name: cabin, dtype: int64

In [63]:
df.survived.sum()

313

In [64]:
df.survived.count()

850

In [71]:
df.groupby(['cabin'])['survived'].mean().sort_values()

cabin
T    0.000000
M    0.282246
G    0.500000
C    0.580645
A    0.583333
F    0.666667
D    0.709677
B    0.733333
E    0.791667
Name: survived, dtype: float64

In [73]:
df.groupby(['cabin'])['survived'].mean().sort_values()

cabin
T    0.000000
M    0.282246
G    0.500000
C    0.580645
A    0.583333
F    0.666667
D    0.709677
B    0.733333
E    0.791667
Name: survived, dtype: float64

In [74]:
ordinal_labels = df.groupby(['cabin'])['survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'G', 'C', 'A', 'F', 'D', 'B', 'E'], dtype='object', name='cabin')

In [75]:
ordinal_labels_1 = {k:i for i, k in enumerate(ordinal_labels, 0)}
ordinal_labels_1

{'T': 0, 'M': 1, 'G': 2, 'C': 3, 'A': 4, 'F': 5, 'D': 6, 'B': 7, 'E': 8}

In [76]:
df['cabin_ordinal'] = df['cabin'].map(ordinal_labels_1)

In [77]:
df

    cabin  survived  cabin_ordinal
0       M         1              1
1       M         0              1
2       M         0              1
3       M         1              1
4       M         0              1
..    ...       ...            ...
845     C         0              3
846     B         0              7
847     M         1              1
848     M         0              1
849     M         0              1

[850 rows x 3 columns]

## Mean Encoding

In [84]:
category_mean = df.groupby(['cabin'])['survived'].mean().to_dict()
category_mean

{'A': 0.5833333333333334,
 'B': 0.7333333333333333,
 'C': 0.5806451612903226,
 'D': 0.7096774193548387,
 'E': 0.7916666666666666,
 'F': 0.6666666666666666,
 'G': 0.5,
 'M': 0.2822458270106222,
 'T': 0.0}

In [81]:
df['cabin_mean'] = df['cabin'].map(category_mean)

In [82]:
df.head(10)

  cabin  survived  cabin_ordinal  cabin_mean
0     M         1              1    0.282246
1     M         0              1    0.282246
2     M         0              1    0.282246
3     M         1              1    0.282246
4     M         0              1    0.282246
5     M         0              1    0.282246
6     M         0              1    0.282246
7     M         1              1    0.282246
8     M         1              1    0.282246
9     M         0              1    0.282246

In [83]:
df.head(20)

   cabin  survived  cabin_ordinal  cabin_mean
0      M         1              1    0.282246
1      M         0              1    0.282246
2      M         0              1    0.282246
3      M         1              1    0.282246
4      M         0              1    0.282246
5      M         0              1    0.282246
6      M         0              1    0.282246
7      M         1              1    0.282246
8      M         1              1    0.282246
9      M         0              1    0.282246
10     C         0              3    0.580645
11     D         1              6    0.709677
12     C         1              3    0.580645
13     M         1              1    0.282246
14     M         0              1    0.282246
15     M         0              1    0.282246
16     M         0              1    0.282246
17     M         1              1    0.282246
18     E         1              8    0.791667
19     M         1              1    0.282246